import '../xiang.dictionary.dart';

// 坤为地
final kunWeiDi = XiangDicItem(
  name: '坤',
  description: '坤：元，亨，利牝马之贞。君子有攸往，先迷后得主，利西南得朋，东北丧朋。安贞吉。',
  judgment: '''
至哉坤元，万物资生，乃顺承天。
坤厚载物，德合无疆。
含弘光大，品物咸亨。
牝马地类，行地无疆，柔顺利贞。
君子攸行，先迷失道，后顺得常。
西南得朋，乃与类行；东北丧朋，乃终有庆。
安贞之吉，应地无疆。
  ''',
  image: '''
地势坤，君子以厚德载物。
履霜坚冰至。
  ''',
  element: '土',
  nature: '柔顺中正',
  attribute: '大吉',
  luck: '大吉大利',
  yaoTexts: [
    '初六：履霜，坚冰至。',  // 初爻
    '六二：直，方，大，不习无不利。',  // 二爻
    '六三：含章可贞。或从王事，无成有终。',  // 三爻
    '六四：括囊，无咎无誉。',  // 四爻
    '六五：黄裳，元吉。',  // 五爻
    '上六：龙战于野，其血玄黄。',  // 上爻
  ],
); 