import '../xiang.dictionary.dart';

// 地火明夷
final diHuoMingYi = XiangDicItem(
  name: '明夷',
  description: '明夷：利艰贞。',
  judgment: '''
明入地中，明夷。
内文明而外柔顺，以蒙大难，文王以之。
利艰贞，晦其明也，内难而能正其志，箕子以之。
  ''',
  image: '''
明入地中，明夷。君子以莅众，用晦而明。
君子以莅众，用晦而明也。
  ''',
  element: '火',
  nature: '晦暗伤害',
  attribute: '晦',
  luck: '凶',
  yaoTexts: [
    '初九：明夷于飞，垂其翼。君子于行，三日不食，有攸往，主人有言。',  // 初爻
    '六二：明夷，夷于左股，用拯马壮，吉。',  // 二爻
    '九三：明夷于南狩，得其大首，不可疾贞。',  // 三爻
    '六四：入于左腹，获明夷之心，于出门庭。',  // 四爻
    '六五：箕子之明夷，利贞。',  // 五爻
    '上六：不明晦，初登于天，后入于地。',  // 上爻
  ],
); 