import '../xiang.dictionary.dart';

// 地雷复
final diLeiFu = XiangDicItem(
  name: '复',
  description: '复：亨。出入无疾，朋来无咎。反复其道，七日来复，利有攸往。',
  judgment: '''
复亨，刚反，动而以顺行。
是以出入无疾，朋来无咎。
反复其道，七日来复，天行也。
利有攸往，刚长也。
复其见天地之心乎？
  ''',
  image: '''
雷在地中，复。先王以至日闭关，商旅不行，后不省方。
复，亨出入无疾，朋来无咎。
  ''',
  element: '木',
  nature: '返本归元',
  attribute: '复',
  luck: '吉',
  yaoTexts: [
    '初九：不远复，无祗悔，元吉。',  // 初爻
    '六二：休复，吉。',  // 二爻
    '六三：频复，厉，无咎。',  // 三爻
    '六四：中行独复。',  // 四爻
    '六五：敦复，无悔。',  // 五爻
    '上六：迷复，凶，有灾眚。用行师，终有大败，以其国君，凶。至于十年不克征。',  // 上爻
  ],
);
