import '../xiang.dictionary.dart';

// 地水师
final diShuiShi = XiangDicItem(
  name: '师',
  description: '师：贞，丈人吉，无咎。',
  judgment: '''
师，众也，贞正也。
能以众正，可以王矣。
刚中而应，行险而顺，以此毒天下，而民从之，吉又何咎矣。
  ''',
  image: '''
地中有水，师。君子以容民畜众。
师出以律，失律凶也。
  ''',
  element: '土',
  nature: '统军治众',
  attribute: '正',
  luck: '吉',
  yaoTexts: [
    '初六：师出以律，否臧凶。',  // 初爻
    '九二：在师中，吉，无咎。王三锡命。',  // 二爻
    '六三：师或舆尸，凶。',  // 三爻
    '六四：师左次，无咎。',  // 四爻
    '六五：田有禽，利执言，无咎。长子帅师，弟子舆尸，贞凶。',  // 五爻
    '上六：大君有命，开国承家，小人勿用。',  // 上爻
  ],
);
