import '../xiang.dictionary.dart';

// 地山谦
final diShanQian = XiangDicItem(
  name: '谦',
  description: '谦：亨，君子有终。',
  judgment: '''
谦，亨，天道下济而光明，地道卑而上行。
天道亏盈而益谦，地道变盈而流谦，鬼神害盈而福谦，人道恶盈而好谦。
谦尊而光，卑而不可逾，君子之终也。
  ''',
  image: '''
地中有山，谦。君子以裒多益寡，称物平施。
谦亨，天道下济。
  ''',
  element: '土',
  nature: '谦逊内敛',
  attribute: '谦',
  luck: '吉',
  yaoTexts: [
    '初六：谦谦君子，用涉大川，吉。',  // 初爻
    '六二：鸣谦，贞吉。',  // 二爻
    '九三：劳谦，君子有终，吉。',  // 三爻
    '六四：无不利，撝谦。',  // 四爻
    '六五：不富以其邻，利用侵伐，无不利。',  // 五爻
    '上六：鸣谦，利用行师，征邑国。',  // 上爻
  ],
);
