import '../xiang.dictionary.dart';

// 地天泰
final diTianTai = XiangDicItem(
  name: '泰',
  description: '泰：小往大来，吉亨。',
  judgment: '''
泰，小往大来，吉亨。
则是天地交，而万物通也；
上下交，而其志同也。
内阳而外阴，内健而外顺，
内君子而外小人，君子道长，小人道消也。
  ''',
  image: '''
天地交泰，后以财成天地之道，辅相天地之宜，以左右民。
物不可以终通，故受之以否。
  ''',
  element: '土',
  nature: '通泰和顺',
  attribute: '泰',
  luck: '大吉',
  yaoTexts: [
    '初九：拔茅茹，以其汇，征吉。',  // 初爻
    '九二：包荒，用冯河，不遐遗，朋亡，得尚于中行。',  // 二爻
    '九三：无平不陂，无往不复，艰贞无咎。勿恤其孚，于食有福。',  // 三爻
    '六四：翩翩，不富以其邻，不戒以孚。',  // 四爻
    '六五：帝乙归妹，以祉元吉。',  // 五爻
    '上六：城复于隍，勿用师。自邑告命，贞吝。',  // 上爻
  ],
);
