import '../xiang.dictionary.dart';

// 风山渐
final fengShanJian = XiangDicItem(
  name: '渐',
  description: '渐：女归吉，利贞。',
  judgment: '''
渐之进也，女归吉也。
进得位，往有功也。
进以正，可以正邦也。
其位刚，得中也。
止而巽，动不穷也。
  ''',
  image: '''
山上有木，渐。君子以居贤德善俗。
山上有木，渐。君子以居贤德善俗。
  ''',
  element: '木',
  nature: '循序渐进',
  attribute: '渐',
  luck: '吉',
  yaoTexts: [
    '初六：鸿渐于干，小子厉，有言，无咎。',  // 初爻
    '六二：鸿渐于磐，饮食衎衎，吉。',  // 二爻
    '九三：鸿渐于陆，夫征不复，妇孕不育，凶；利御寇。',  // 三爻
    '六四：鸿渐于木，或得其桷，无咎。',  // 四爻
    '九五：鸿渐于陵，妇三岁不孕，终莫之胜，吉。',  // 五爻
    '上九：鸿渐于陆，其羽可用为仪，吉。',  // 上爻
  ],
);
