import '../xiang.dictionary.dart';

// 风雷中孚
final fengLeiZhongFu = XiangDicItem(
  name: '中孚',
  description: '中孚：豚鱼，吉，利涉大川，利贞。',
  judgment: '''
中孚，柔在内而刚得中。
说而巽，孚，乃化邦也。
豚鱼吉，信及豚鱼也。
利涉大川，乘木舟虚也。
中孚以利贞，乃应乎天也。
  ''',
  image: '''
泽上有风，中孚。君子以议狱缓死。
泽上有风，中孚。君子以议狱缓死。
  ''',
  element: '木',
  nature: '诚信感孚',
  attribute: '信',
  luck: '吉',
  yaoTexts: [
    '初九：虞吉，有他不燕。',  // 初爻
    '九二：鸣鹤在阴，其子和之，我有好爵，吾与尔靡之。',  // 二爻
    '六三：得敌，或鼓或罢，或泣或歌。',  // 三爻
    '六四：月几望，马匹亡，无咎。',  // 四爻
    '九五：有孚挛如，无咎。',  // 五爻
    '上九：翰音登于天，贞凶。',  // 上爻
  ],
); 