import '../xiang.dictionary.dart';

// 风雷益
final fengLeiYi = XiangDicItem(
  name: '益',
  description: '益：利有攸往，利涉大川。',
  judgment: '''
益，损上益下，民说无疆。
自上下下，其道大光。
利有攸往，中正有庆。
利涉大川，木道乃行。
益动而巽，日进无疆。
  ''',
  image: '''
风雷，益。君子以见善则迁，有过则改。
益，损上益下也。
  ''',
  element: '木',
  nature: '利益增进',
  attribute: '益',
  luck: '吉',
  yaoTexts: [
    '初九：利用为大作，元吉，无咎。',  // 初爻
    '六二：或益之，十朋之龟弗克违，永贞吉。王用享于帝，吉。',  // 二爻
    '六三：益之用凶事，无咎。有孚中行，告公用圭。',  // 三爻
    '六四：中行，告公从。利用为依迁国。',  // 四爻
    '九五：有孚惠心，勿问元吉。有孚惠我德。',  // 五爻
    '上九：莫益之，或击之，立心勿恒，凶。',  // 上爻
  ],
);
