import '../xiang.dictionary.dart';

// 风泽涣
final fengZeHuan = XiangDicItem(
  name: '涣',
  description: '涣：亨。王假有庙，利涉大川，利贞。',
  judgment: '''
涣，亨。刚来而不穷，柔得位乎外而上同。
王假有庙，王乃在中也。
利涉大川，乘木有功也。
  ''',
  image: '''
风行水上，涣。先王以享于帝立庙。
风行水上，涣。先王以享于帝立庙。
  ''',
  element: '金',
  nature: '涣散分离',
  attribute: '散',
  luck: '凶',
  yaoTexts: [
    '初六：用拯马壮，吉。',  // 初爻
    '九二：涣奔其机，悔亡。',  // 二爻
    '六三：涣其躬，无悔。',  // 三爻
    '六四：涣其群，元吉。涣有丘，匪夷所思。',  // 四爻
    '九五：涣汗其大号，涣王居，无咎。',  // 五爻
    '上九：涣其血，去逖出，无咎。',  // 上爻
  ],
); 