import '../xiang.dictionary.dart';

// 风天小畜
final fengTianXiaoXu = XiangDicItem(
  name: '小畜',
  description: '小畜：亨。密云不雨，自我西郊。',
  judgment: '''
小畜，柔得位而上下应之，曰小畜。
健而巽，刚中而志行，乃亨。
密云不雨，尚往也。
自我西郊，施未行也。
  ''',
  image: '''
风行天上，小畜。君子以懿文德。
有孚悔亡，志行也。
  ''',
  element: '金',
  nature: '蓄养待进',
  attribute: '止',
  luck: '吉',
  yaoTexts: [
    '初九：复自道，何其咎，吉。',  // 初爻
    '九二：牵复，吉。',  // 二爻
    '九三：舆说辐，夫妻反目。',  // 三爻
    '六四：有孚，血去惕出，无咎。',  // 四爻
    '九五：有孚挛如，富以其邻。',  // 五爻
    '上九：既雨既处，尚德载，妇贞厉。月几望，君子征凶。',  // 上爻
  ],
); 