import '../xiang.dictionary.dart';

// 风地观
final fengDiGuan = XiangDicItem(
  name: '观',
  description: '观：盥而不荐，有孚颙若。',
  judgment: '''
大观在上，顺而巽，中正以观天下。
观，盥而不荐，有孚颙若，下观而化也。
观天之神道，而四时不忒，圣人以神道设教，而天下服矣。
  ''',
  image: '''
风行地上，观。先王以省方观民设教。
观，盥而不荐，有孚颙若。
  ''',
  element: '土',
  nature: '观察明察',
  attribute: '观',
  luck: '平',
  yaoTexts: [
    '初六：童观，小人无咎，君子吝。',  // 初爻
    '六二：窥观，利女贞。',  // 二爻
    '六三：观我生，进退。',  // 三爻
    '六四：观国之光，利用宾于王。',  // 四爻
    '九五：观我生，君子无咎。',  // 五爻
    '上九：观其生，君子无咎。',  // 上爻
  ],
);
