import '../xiang.dictionary.dart';

// 风火家人
final fengHuoJiaRen = XiangDicItem(
  name: '家人',
  description: '家人：利女贞。',
  judgment: '''
家人，利女贞。
女正位乎内，男正位乎外，天地之大义也。
家人有严君焉，父母之谓也。
父父，子子，兄兄，弟弟，夫夫，妇妇，而家道正。
正家而天下定矣。
  ''',
  image: '''
风自火出，家人。君子以言有物而行有恒。
家人利女贞，女正位也。
  ''',
  element: '火',
  nature: '家道和睦',
  attribute: '家',
  luck: '吉',
  yaoTexts: [
    '初九：闲有家，悔亡。',  // 初爻
    '六二：无攸遂，在中馈，贞吉。',  // 二爻
    '九三：家人嗃嗃，悔厉吉，妇子嘻嘻，终吝。',  // 三爻
    '六四：富家，大吉。',  // 四爻
    '九五：王假有家，勿恤，吉。',  // 五爻
    '上九：有孚威如，终吉。',  // 上爻
  ],
); 