import '../xiang.dictionary.dart';

// 艮为山
final genGen = XiangDicItem(
  name: '艮',
  description: '艮：艮其背，不获其身，行其庭，不见其人，无咎。',
  judgment: '''
艮，止也。
时止则止，时行则行，动静不失其时，其道光明。
艮其止，止其所也。
上下敌应，不相与也。
是以不获其身，行其庭不见其人，无咎也。
  ''',
  image: '''
兼山，艮。君子以思不出其位。
兼山，艮。君子以思不出其位。
  ''',
  element: '土',
  nature: '止而不止',
  attribute: '止',
  luck: '平',
  yaoTexts: [
    '初六：艮其趾，无咎，利永贞。',  // 初爻
    '六二：艮其腓，不拯其随，其心不快。',  // 二爻
    '九三：艮其限，列其夤，厉薰心。',  // 三爻
    '六四：艮其身，无咎。',  // 四爻
    '六五：艮其辅，言有序，悔亡。',  // 五爻
    '上九：敦艮，吉。',  // 上爻
  ],
); 