import '../xiang.dictionary.dart';

// 火风鼎
final huoFengDing = XiangDicItem(
  name: '鼎',
  description: '鼎：元吉，亨。',
  judgment: '''
鼎，象也。
以木巽火，亨饪也。
圣人亨以享上帝，而大亨以养圣贤。
巽而耳目聪明，柔进而上行，得中而应乎刚，是以元亨。
  ''',
  image: '''
木上有火，鼎。君子以正位凝命。
木上有火，鼎。君子以正位凝命。
  ''',
  element: '火',
  nature: '稳重图变',
  attribute: '鼎',
  luck: '吉',
  yaoTexts: [
    '初六：鼎颠趾，利出否，得妾以其子，无咎。',  // 初爻
    '九二：鼎有实，我仇有疾，不我能即，吉。',  // 二爻
    '九三：鼎耳革，其行塞，雉膏不食，方雨亏悔，终吉。',  // 三爻
    '九四：鼎折足，覆公餗，其形渥，凶。',  // 四爻
    '六五：鼎黄耳金铉，利贞。',  // 五爻
    '上九：鼎玉铉，大吉，无不利。',  // 上爻
  ],
);
