import '../xiang.dictionary.dart';

// 火山旅
final huoShanLv = XiangDicItem(
  name: '旅',
  description: '旅：小亨，旅贞吉。',
  judgment: '''
旅，小亨，柔得中乎外，而顺乎刚，止而丽乎明，是以小亨，旅贞吉也。
旅之时义大矣哉！
  ''',
  image: '''
山上有火，旅。君子以明慎用刑，而不留狱。
山上有火，旅。君子以明慎用刑，而不留狱。
  ''',
  element: '火',
  nature: '羁旅行役',
  attribute: '旅',
  luck: '凶',
  yaoTexts: [
    '初六：旅琐琐，斯其所取灾。',  // 初爻
    '六二：旅即次，怀其资，得童仆贞。',  // 二爻
    '九三：旅焚其次，丧其童仆，贞厉。',  // 三爻
    '九四：旅于处，得其资斧，我心不快。',  // 四爻
    '六五：射雉一矢亡，终以誉命。',  // 五爻
    '上九：鸟焚其巢，旅人先笑后号啕。丧牛于易，凶。',  // 上爻
  ],
);
