import '../xiang.dictionary.dart';

// 火地晋
final huoDiJin = XiangDicItem(
  name: '晋',
  description: '晋：康侯用锡马蕃庶，昼日三接。',
  judgment: '''
晋，进也。
明出地上，顺而丽乎大明，柔进而上行。
是以康侯用锡马蕃庶，昼日三接也。
  ''',
  image: '''
明出地上，晋。君子以自昭明德。
明出地上，顺而丽乎大明。
  ''',
  element: '火',
  nature: '光明进取',
  attribute: '进',
  luck: '吉',
  yaoTexts: [
    '初六：晋如，摧如，贞吉。罔孚，裕无咎。',  // 初爻
    '六二：晋如，愁如，贞吉。受兹介福，于其王母。',  // 二爻
    '六三：众允，悔亡。',  // 三爻
    '九四：晋如，鼫鼠，贞厉。',  // 四爻
    '六五：悔亡，失得勿恤，往吉，无不利。',  // 五爻
    '上九：晋其角，维用伐邑，厉吉无咎，贞吝。',  // 上爻
  ],
);
