import '../xiang.dictionary.dart';

// 坎坎习坎
final kanKanXiKan = XiangDicItem(
  name: '坎',
  description: '坎：习坎，有孚，维心亨，行有尚。',
  judgment: '''
习坎，重险也。
水流而不盈，行险而不失其信。
维心亨，乃以刚中也。
行有尚，往有功也。
天险不可升也，地险山川丘陵也，王公设险以守其国。
险之时用大矣哉！
  ''',
  image: '''
水洊至，习坎。君子以常德行，习教事。
习坎入坎，失道凶也。
  ''',
  element: '水',
  nature: '险中有险',
  attribute: '险',
  luck: '凶',
  yaoTexts: [
    '初六：习坎，入于坎窞，凶。',  // 初爻
    '九二：坎有险，求小得。',  // 二爻
    '六三：来之坎坎，险且枕，入于坎窞，勿用。',  // 三爻
    '六四：樽酒簋贰，用缶，纳约自牖，终无咎。',  // 四爻
    '九五：坎不盈，只既平，无咎。',  // 五爻
    '上六：系用徽纆，寘于丛棘，三岁不得，凶。',  // 上爻
  ],
); 