import '../xiang.dictionary.dart';

// 坎离既济
final kanLiJiJi = XiangDicItem(
  name: '既济',
  description: '既济：亨，小利贞，初吉终乱。',
  judgment: '''
既济，亨，小者亨也。
利贞，刚柔正而位当也。
初吉，柔得中也。
终止则乱，其道穷也。
  ''',
  image: '''
水在火上，既济。君子以思患而预防之。
水在火上，既济。君子以思患而预防之。
  ''',
  element: '水',
  nature: '成功之后',
  attribute: '济',
  luck: '平',
  yaoTexts: [
    '初九：曳其轮，濡其尾，无咎。',  // 初爻
    '六二：妇丧其髴，勿逐，七日得。',  // 二爻
    '九三：高宗伐鬼方，三年克之，小人勿用。',  // 三爻
    '六四：繻有衣袽，终日戒。',  // 四爻
    '九五：东邻杀牛，不如西邻之禴祭，实受其福。',  // 五爻
    '上六：濡其首，厉。',  // 上爻
  ],
); 