import '../xiang.dictionary.dart';

// 雷泽归妹
final leiZeGuiMei = XiangDicItem(
  name: '归妹',
  description: '归妹：征凶，无攸利。',
  judgment: '''
归妹，天地之大义也。
天地不交，而万物不兴。
归妹，人之终始也。
说以动，所归妹也。
征凶，位不当也。
无攸利，柔乘刚也。
  ''',
  image: '''
泽上有雷，归妹。君子以永终知敝。
泽上有雷，归妹。君子以永终知敝。
  ''',
  element: '金',
  nature: '嫁娶婚姻',
  attribute: '归',
  luck: '凶',
  yaoTexts: [
    '初九：归妹以娣，跛能履，征吉。',  // 初爻
    '九二：眇能视，利幽人之贞。',  // 二爻
    '六三：归妹以须，反归以娣。',  // 三爻
    '九四：归妹愆期，迟归有时。',  // 四爻
    '六五：帝乙归妹，其君之袂，不如其娣之袂良，月几望，吉。',  // 五爻
    '上六：女承筐无实，士刲羊无血，无攸利。',  // 上爻
  ],
); 