import '../xiang.dictionary.dart';

// 雷天大壮
final leiTianDaZhuang = XiangDicItem(
  name: '大壮',
  description: '大壮：利贞。',
  judgment: '''
大壮，大者壮也。
刚以动，故壮。
大壮利贞，大者正也。
正大而天地之情可见矣。
  ''',
  image: '''
雷在天上，大壮。君子以非礼弗履。
大壮，君子以非礼弗履也。
  ''',
  element: '金',
  nature: '刚健壮大',
  attribute: '壮',
  luck: '吉',
  yaoTexts: [
    '初九：壮于趾，征凶，有孚。',  // 初爻
    '九二：贞吉。',  // 二爻
    '九三：小人用壮，君子用罔，贞厉。羝羊触藩，羸其角。',  // 三爻
    '九四：贞吉悔亡，藩决不羸，壮于大舆之輹。',  // 四爻
    '六五：丧羊于易，无悔。',  // 五爻
    '上六：羝羊触藩，不能退，不能遂，无攸利，艰则吉。',  // 上爻
  ],
); 