import '../xiang.dictionary.dart';

// 雷风小过
final leiFengXiaoGuo = XiangDicItem(
  name: '小过',
  description: '小过：亨，利贞，可小事，不可大事。飞鸟遗之音，不宜上，宜下，大吉。',
  judgment: '''
小过，小者过而亨也。
过以利贞，与时行也。
柔得中，是以小事吉也。
刚失位而不中，是以不可大事也。
有飞鸟之象焉，有飞鸟遗之音，不宜上，宜下，大吉，上逆而下顺也。
  ''',
  image: '''
山上有雷，小过。君子以行过乎恭，丧过乎哀，用过乎俭。
山上有雷，小过。君子以行过乎恭，丧过乎哀，用过乎俭。
  ''',
  element: '木',
  nature: '小事亨通',
  attribute: '过',
  luck: '平',
  yaoTexts: [
    '初六：飞鸟以凶。',  // 初爻
    '六二：过其祖，遇其妣，不及其君，遇其臣，无咎。',  // 二爻
    '九三：弗过防之，从或戕之，凶。',  // 三爻
    '九四：无咎，弗过遇之，往厉必戒，勿用永贞。',  // 四爻
    '六五：密云不雨，自我西郊，公弋取彼在穴。',  // 五爻
    '上六：弗遇过之，飞鸟离之，凶，是谓灾眚。',  // 上爻
  ],
); 