import '../xiang.dictionary.dart';

// 雷地豫
final leiDiYu = XiangDicItem(
  name: '豫',
  description: '豫：利建侯行师。',
  judgment: '''
豫，刚应而志行，顺以动，豫。
豫，顺以动，故天地如之，而况建侯行师乎？
天地以顺动，故日月不过而四时不忒。
圣人以顺动，则刑罚清而民服。
豫之时义大矣哉！
  ''',
  image: '''
雷出地上，豫。先王以作乐崇德，殷荐之上帝，以配祖考。
豫，刚应而志行。
  ''',
  element: '木',
  nature: '和悦顺动',
  attribute: '悦',
  luck: '吉',
  yaoTexts: [
    '初六：鸣豫，凶。',  // 初爻
    '六二：介于石，不终日，贞吉。',  // 二爻
    '六三：盱豫，悔。迟有悔。',  // 三爻
    '九四：由豫，大有得。勿疑，朋盍簪。',  // 四爻
    '六五：贞疾，恒不死。',  // 五爻
    '上六：冥豫，成有渝，无咎。',  // 上爻
  ],
);
