import '../xiang.dictionary.dart';

// 雷水解
final leiShuiJie = XiangDicItem(
  name: '解',
  description: '解：利西南，无所往，其来复吉。有攸往，夙吉。',
  judgment: '''
解，险以动，动而免乎险，解。
解利西南，往得众也。
其来复吉，乃得中也。
有攸往夙吉，往有功也。
天地解而雷雨作，雷雨作而百果草木皆甲坼，解之时大矣哉。
  ''',
  image: '''
雷雨作，解。君子以赦过宥罪。
解，险以动，动而免乎险。
  ''',
  element: '水',
  nature: '解除化解',
  attribute: '解',
  luck: '吉',
  yaoTexts: [
    '初六：无咎。',  // 初爻
    '九二：田获三狐，得黄矢，贞吉。',  // 二爻
    '六三：负且乘，致寇至，贞吝。',  // 三爻
    '九四：解而拇，朋至斯孚。',  // 四爻
    '六五：君子维有解，吉；有孚于小人。',  // 五爻
    '上六：公用射隼于高墉之上，获之，无不利。',  // 上爻
  ],
);
