import '../xiang.dictionary.dart';

// 雷风恒
final leiFengHeng = XiangDicItem(
  name: '恒',
  description: '恒：亨，无咎，利贞，利有攸往。',
  judgment: '''
恒，久也。
刚上而柔下，雷风相与，巽而动，刚柔皆应，恒。
恒亨无咎，利贞；久于其道也，天地之道，恒久而不已也。
利有攸往，终则有始也。
日月得天而能久照，四时变化而能久成，圣人久于其道而天下化成。
观其所恒，而天地万物之情可见矣！
  ''',
  image: '''
雷风，恒。君子以立不易方。
雷以动之，风以散之，恒。
  ''',
  element: '木',
  nature: '持久恒常',
  attribute: '恒',
  luck: '吉',
  yaoTexts: [
    '初六：浚恒，贞凶，无攸利。',  // 初爻
    '九二：悔亡。',  // 二爻
    '九三：不恒其德，或承之羞，贞吝。',  // 三爻
    '九四：田无禽。',  // 四爻
    '六五：恒其德，贞，妇人吉，夫子凶。',  // 五爻
    '上六：振恒，凶。',  // 上爻
  ],
);
