import '../xiang.dictionary.dart';

// 离坎未济
final liKanWeiJi = XiangDicItem(
  name: '未济',
  description: '未济：亨，小狐汔济，濡其尾，无攸利。',
  judgment: '''
未济，亨，柔得中也。
小狐汔济，未出中也。
濡其尾，无攸利，不续终也。
虽不当位，刚柔应也。
  ''',
  image: '''
火在水上，未济。君子以慎辨物居方。
火在水上，未济。君子以慎辨物居方。
  ''',
  element: '水',
  nature: '事业未成',
  attribute: '济',
  luck: '凶',
  yaoTexts: [
    '初六：濡其尾，吝。',  // 初爻
    '九二：曳其轮，贞吉。',  // 二爻
    '六三：未济，征凶，利涉大川。',  // 三爻
    '九四：贞吉，悔亡，震用伐鬼方，三年有赏于大国。',  // 四爻
    '六五：贞吉，无悔，君子之光，有孚，吉。',  // 五爻
    '上九：有孚于饮酒，无咎，濡其首，有孚失是。',  // 上爻
  ],
); 