import '../xiang.dictionary.dart';

// 离离离
final liLiLi = XiangDicItem(
  name: '离',
  description: '离：利贞，亨。畜牝牛，吉。',
  judgment: '''
离，丽也。
日月丽乎天，百谷草木丽乎土，重明以丽乎正，乃化成天下。
柔丽乎中正，故亨。
畜牝牛吉也。
  ''',
  image: '''
明两作，离。大人以继明照于四方。
丽乎日月，就明之光也。
  ''',
  element: '火',
  nature: '光明丽泽',
  attribute: '明',
  luck: '吉',
  yaoTexts: [
    '初九：履错然，敬之无咎。',  // 初爻
    '六二：黄离，元吉。',  // 二爻
    '九三：日昃之离，不鼓缶而歌，则大耋之嗟，凶。',  // 三爻
    '九四：突如其来如，焚如，死如，弃如。',  // 四爻
    '六五：出涕沱若，戚嗟若，吉。',  // 五爻
    '上九：王用出征，有嘉折首，获匪其丑，无咎。',  // 上爻
  ],
); 