import 'package:liuyao_flutter/constants/xiang.dictionary.dart';

XiangDicItem qianWeiTian = XiangDicItem("乾","乾为天","刚健中正","""乾卦原文
乾。元，亨，利，贞。
象曰：天行健，君子以自强不息。
白话文解释
乾卦：大吉大利，吉利的贞卜。
《象辞》说：天道刚健，运行不已。君子观此卦象，从而以天为法，自强不息。
《断易天机》解
乾象征天，六阳爻构成乾卦，为《易经》六十四卦之首。纯阳刚建，其性刚强，其行劲健，大通而至正，兆示大通而有利，但须行正道，方可永远亨通。
北宋易学家邵雍解
刚健旺盛，发育之功；完事顺利，谨防太强。
得此卦者，天行刚健，自强不息，名利双收之象，宜把握机会，争取成果。女人得此卦则有过于刚直之嫌。
台湾国学大儒傅佩荣解
时运：临事刚健，自强不息。
财运：施比受有福，不利买而利卖。
家宅：积善有余庆；女子过刚宜慎重。
身体：保健有恒。
传统解卦
这个卦是同卦（下乾上乾）相叠。象征天，喻龙（德才的君子），又象征纯粹的阳和健，表明兴盛强健。乾卦是根据万物变通的道理，以“元、亨、利、贞”为卦辞，表示吉祥如意，教导人遵守天道的德行。
大象：天行刚健，自强不息。
运势：飞龙在天，名利双收之象，宜把握机会，争取成果。
事业：大吉大利，万事如意，心想事成，自有天佑，春风得意，事业如日中天。但阳气已达顶点，盛极必衰，务须提高警惕，小心谨慎。力戒骄傲，冷静处世，心境平和，如是则能充分发挥才智，保证事业成功。
经商：十分顺利，有发展向上的大好机会。但切勿操之过急，宜冷静分析形势，把握时机，坚持商业道德，冷静对待中途出现的困难，定会有满意的结果。
求名：潜在能力尚未充分发挥，只要进一步努力，克服骄傲自满情绪，进业修德，以渊博学识和高尚品质，成君子之名。
婚恋：阳盛阴衰，但刚柔可相济，形成美满结果。女性温柔者更佳。
决策：可成就大的事业。坚持此卦的刚健、正直、公允的实质，修养德行，积累知识，坚定信念，自强不息，必能克服困难，消除灾难。

第一卦的哲学含义

乾卦所包含的范围是：凡是积极向上的、刚健有力的、权威的、圆形的、男性长辈、珍贵的、富有的、寒冷的、坚硬易碎的、在上的等事物，都归于乾卦。六十四卦中乾用来象征天、阳、日、君、父、夫、圆、玉、金、冰、寒、马、赤色、快速、快车、不知疲倦等。
乾与人体对应的部位是：头、首、胸部、大肠、肺、右足、右下腹、精液、男性生殖器等。
六十四卦之中的乾，是两个乾卦同卦相叠而成，象征天，用龙来喻指有德才的君子，又象征纯粹的阳和健，表明兴盛强健。乾卦是根据万物变通的道理，喻示吉祥如意，教导人们顺天道而行。
乾卦是六十四卦中的第一卦，《序卦》讲述了六十四卦的排列次序，其指出：“有天地，然后万物生焉。”意思是以乾卦为天，以坤卦为地。有天地才能化生万物。乾代表阳刚劲健的主动力，坤则是承受力，两者相摩相荡而变化生出万物。
《象》中这样解释乾卦：天行健，君子以自强不息。这里指出：天道运行周而复始，永无止息，谁也不能阻挡，君子应效法天道，自立自强，不停地奋斗下去。
乾卦属于上上卦。《象》中这样来断此卦：困龙得水好运交，不由喜气上眉梢，一切谋望皆如意，向后时运渐渐高。""","""""","""""","""""","""""","""""","""""");