import '../xiang.dictionary.dart';

// 山水蒙
final shanShuiMeng = XiangDicItem(
  name: '蒙',
  description: '蒙：亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。',
  judgment: '''
蒙，山下有险，险而止，蒙。
蒙亨，以亨行时中也。
匪我求童蒙，童蒙求我，志应也。
初筮告，以刚中也。
再三渎，渎则不告，渎蒙也。
蒙以养正，圣功也。
  ''',
  image: '''
山下出泉，蒙。君子以果行育德。
利用刑人，以正法也。
  ''',
  element: '水',
  nature: '蒙昧启蒙',
  attribute: '昧',
  luck: '吉',
  yaoTexts: [
    '初六：发蒙，利用刑人，用说桎梏，以往吝。',  // 初爻
    '九二：包蒙吉。纳妇吉。子克家。',  // 二爻
    '六三：勿用取女，见金夫，不有躬，无攸利。',  // 三爻
    '六四：困蒙，吝。',  // 四爻
    '六五：童蒙，吉。',  // 五爻
    '上九：击蒙。不利为寇，利御寇。',  // 上爻
  ],
);