import '../xiang.dictionary.dart';

// 山风蛊
final shanFengGu = XiangDicItem(
  name: '蛊',
  description: '蛊：元亨，利涉大川。先甲三日，后甲三日。',
  judgment: '''
蛊，刚上而柔下，巽而止，蛊。
蛊，元亨，而天下治也。
利涉大川，往有事也。
先甲三日，后甲三日，终则有始，天行也。
  ''',
  image: '''
山下有风，蛊。君子以振民育德。
振民育德，以修身也。
  ''',
  element: '木',
  nature: '振荡革新',
  attribute: '革',
  luck: '平',
  yaoTexts: [
    '初六：干父之蛊，有子，考无咎，厉终吉。',  // 初爻
    '九二：干母之蛊，不可贞。',  // 二爻
    '九三：干父之蛊，小有悔，无大咎。',  // 三爻
    '六四：裕父之蛊，往见吝。',  // 四爻
    '六五：干父之蛊，用誉。',  // 五爻
    '上九：不事王侯，高尚其事。',  // 上爻
  ],
);
