import '../xiang.dictionary.dart';

// 山水蹇
final shanShuiJian = XiangDicItem(
  name: '蹇',
  description: '蹇：利西南，不利东北；利见大人，贞吉。',
  judgment: '''
蹇，难也，险在前也。
见险而能止，知矣哉。
蹇利西南，往得中也。
不利东北，其道穷也。
利见大人，往有功也。
当位贞吉，以正邦也。
蹇之时用大矣哉。
  ''',
  image: '''
山上有水，蹇。君子以反身修德。
山上有水，蹇。君子以反身修德。
  ''',
  element: '水',
  nature: '艰难险阻',
  attribute: '难',
  luck: '凶',
  yaoTexts: [
    '初六：往蹇，来誉。',  // 初爻
    '六二：王臣蹇蹇，匪躬之故。',  // 二爻
    '九三：往蹇来反。',  // 三爻
    '六四：往蹇来连。',  // 四爻
    '九五：大蹇朋来。',  // 五爻
    '上六：往蹇来硕，吉；利见大人。',  // 上爻
  ],
); 