import '../xiang.dictionary.dart';

// 山雷颐
final shanLeiYi = XiangDicItem(
  name: '颐',
  description: '颐：贞吉。观颐，自求口实。',
  judgment: '''
颐，贞吉，养正则吉也。
观颐，观其所养也；自求口实，观其自养也。
天地养万物，圣人养贤，以及万民。
颐之时大矣哉！
  ''',
  image: '''
山下有雷，颐。君子以慎言语，节饮食。
贞吉养正，则吉也。
  ''',
  element: '土',
  nature: '养正修身',
  attribute: '养',
  luck: '吉',
  yaoTexts: [
    '初九：舍尔灵龟，观我朵颐，凶。',  // 初爻
    '六二：颠颐，拂经，于丘颐，征凶。',  // 二爻
    '六三：拂颐，贞凶，十年勿用，无攸利。',  // 三爻
    '六四：颠颐，吉。虎视眈眈，其欲逐逐，无咎。',  // 四爻
    '六五：拂经，居贞吉，不可涉大川。',  // 五爻
    '上九：由颐，厉吉，利涉大川。',  // 上爻
  ],
);
