import '../xiang.dictionary.dart';

// 山天大畜
final shanTianDaXu = XiangDicItem(
  name: '大畜',
  description: '大畜：利贞，不家食吉，利涉大川。',
  judgment: '''
大畜，刚健笃实辉光，日新其德。
刚上而尚贤。
能止健，大正也。
不家食吉，养贤也。
利涉大川，应乎天也。
  ''',
  image: '''
天在山中，大畜。君子以多识前言往行，以畜其德。
大畜，利贞。
  ''',
  element: '土',
  nature: '蓄养待进',
  attribute: '畜',
  luck: '吉',
  yaoTexts: [
    '初九：有厉，利已。',  // 初爻
    '九二：舆说輹。',  // 二爻
    '九三：良马逐，利艰贞。日闲舆卫，利有攸往。',  // 三爻
    '六四：童牛之牿，元吉。',  // 四爻
    '六五：豮豕之牙，吉。',  // 五爻
    '上九：何天之衢，亨。',  // 上爻
  ],
); 