import '../xiang.dictionary.dart';

// 山泽损
final shanZeSun = XiangDicItem(
  name: '损',
  description: '损：有孚，元吉，无咎，可贞，利有攸往。曷之用？二簋可用享。',
  judgment: '''
损，损下益上，其道上行。
损而有孚，元吉，无咎，可贞，利有攸往。
曷之用？二簋可用享。
时损益，盈虚与民共之。
  ''',
  image: '''
山下有泽，损。君子以惩忿窒欲。
损，损下益上，其道上行。
  ''',
  element: '金',
  nature: '损下益上',
  attribute: '损',
  luck: '平',
  yaoTexts: [
    '初九：已事遄往，无咎，酌损之。',  // 初爻
    '九二：利贞，征凶，弗损益之。',  // 二爻
    '六三：三人行，则损一人；一人行，则得其友。',  // 三爻
    '六四：损其疾，使遄有喜，无咎。',  // 四爻
    '六五：或益之，十朋之龟弗克违，元吉。',  // 五爻
    '上九：弗损益之，无咎，贞吉，利有攸往，得臣无家。',  // 上爻
  ],
);
