import '../xiang.dictionary.dart';

// 山火贲
final shanHuoBi = XiangDicItem(
  name: '贲',
  description: '贲：亨。小利有攸往。',
  judgment: '''
贲亨，柔来而文刚，故亨。
分刚上而文柔，故小利有攸往。
天文也，文明以止，人文也。
观乎天文，以察时变；观乎人文，以化成天下。
  ''',
  image: '''
山下有火，贲。君子以明庶政，无敢折狱。
贲，亨，柔来而文刚也。
  ''',
  element: '火',
  nature: '文明止息',
  attribute: '文',
  luck: '吉',
  yaoTexts: [
    '初九：贲其趾，舍车而徒。',  // 初爻
    '六二：贲其须。',  // 二爻
    '九三：贲如，濡如，永贞吉。',  // 三爻
    '六四：贲如，皤如，白马翰如，匪寇婚媾。',  // 四爻
    '六五：贲于丘园，束帛戋戋。吝，终吉。',  // 五爻
    '上九：白贲，无咎。',  // 上爻
  ],
); 