import '../xiang.dictionary.dart';

// 水天需
final shuiTianXu = XiangDicItem(
  name: '需',
  description: '需：有孚，光亨，贞吉。利涉大川。',
  judgment: '''
需，须也。
险在前也，刚健而不陷，其义不困穷矣。
需有孚，光亨，贞吉。
位乎天位，以正中也。
利涉大川，往有功也。
  ''',
  image: '''
云上于天，需。君子以饮食宴乐。
需于郊，不犯难行也。
  ''',
  element: '水',
  nature: '需待守正',
  attribute: '险',
  luck: '吉',
  yaoTexts: [
    '初九：需于郊。利用恒，无咎。',  // 初爻
    '九二：需于沙。小有言，终吉。',  // 二爻
    '九三：需于泥，致寇至。',  // 三爻
    '六四：需于血，出自穴。',  // 四爻
    '九五：需于酒食，贞吉。',  // 五爻
    '上六：入于穴，有不速之客三人来，敬之终吉。',  // 上爻
  ],
);
