import '../xiang.dictionary.dart';

// 水地比
final shuiDiBi = XiangDicItem(
  name: '比',
  description: '比：吉。原筮，元永贞，无咎。不宁方来，后夫凶。',
  judgment: '''
比，吉也，比辅也。
下顺从也。
原筮元永贞，无咎，以刚中也。
不宁方来，上下应也。
后夫凶，其道穷也。
  ''',
  image: '''
地上有水，比。先王以建万国，亲诸侯。
比之初，可以辅也。
  ''',
  element: '水',
  nature: '亲比辅助',
  attribute: '顺',
  luck: '吉',
  yaoTexts: [
    '初六：有孚比之，无咎。有孚盈缶，终来有他，吉。',  // 初爻
    '六二：比之自内，贞吉。',  // 二爻
    '六三：比之匪人。',  // 三爻
    '六四：外比之，贞吉。',  // 四爻
    '九五：显比，王用三驱，失前禽。邑人不诫，吉。',  // 五爻
    '上六：比之无首，凶。',  // 上爻
  ],
);
