import '../xiang.dictionary.dart';

// 水雷屯
final shuiLeiZhun = XiangDicItem(
  name: '屯',
  description: '屯：元，亨，利，贞。勿用有攸往，利建侯。',
  judgment: '''
屯，刚柔始交而难生。
动乎险中，大亨贞。
雷雨之动满盈，天造草昧。
宜建侯而不宁。
  ''',
  image: '''
云雷屯，君子以经纶。
马匹亡，无逐，自复。
  ''',
  element: '木',
  nature: '险难初始',
  attribute: '险',
  luck: '大吉',
  yaoTexts: [
    '初九：磐桓，利居贞，利建侯。',  // 初爻
    '六二：屯如邅如，乘马班如。匪寇婚媾，女子贞不字，十年乃字。',  // 二爻
    '六三：即鹿无虞，惟入于林中。君子几不如舍。往吝。',  // 三爻
    '六四：乘马班如，求婚媾。往吉，无不利。',  // 四爻
    '九五：屯其膏，小贞吉，大贞凶。',  // 五爻
    '上六：乘马班如，泣血涟如。',  // 上爻
  ],
);