import '../xiang.dictionary.dart';

// 水风井
final shuiFengJing = XiangDicItem(
  name: '井',
  description: '井：改邑不改井，无丧无得，往来井井。汔至，亦未繘井，羸其瓶，凶。',
  judgment: '''
巽乎水而上水，井。井养而不穷也。
改邑不改井，乃以刚中也。
汔至亦未繘井，未有功也。
羸其瓶，是以凶也。
  ''',
  image: '''
木上有水，井。君子以劳民劝相。
木上有水，井。君子以劳民劝相。
  ''',
  element: '木',
  nature: '滋养供给',
  attribute: '井',
  luck: '平',
  yaoTexts: [
    '初六：井泥不食，旧井无禽。',  // 初爻
    '九二：井谷射鲋，瓮敝漏。',  // 二爻
    '九三：井渫不食，为我心恻，可用汲，王明，并受其福。',  // 三爻
    '六四：井甃，无咎。',  // 四爻
    '九五：井洌，寒泉食。',  // 五爻
    '上六：井收勿幕，有孚元吉。',  // 上爻
  ],
);
