import '../xiang.dictionary.dart';

// 天水讼
final tianShuiSong = XiangDicItem(
  name: '讼',
  description: '讼：有孚，窒惕，中吉。终凶。利见大人，不利涉大川。',
  judgment: '''
讼，上刚下险，险而健，讼。
讼有孚，窒惕，中吉，刚来而得中也。
终凶，讼不可成也。
利见大人，尚中正也。
不利涉大川，入于渊也。
  ''',
  image: '''
天与水违行，讼。君子以作事谋始。
讼，不可成也。
  ''',
  element: '金',
  nature: '争讼不和',
  attribute: '凶',
  luck: '凶',
  yaoTexts: [
    '初六：不永所事，小有言，终吉。',  // 初爻
    '九二：不克讼，归而逋，其邑人三百户，无眚。',  // 二爻
    '六三：食旧德，贞厉，终吉。或从王事，无成。',  // 三爻
    '九四：不克讼，复即命，渝，安贞吉。',  // 四爻
    '九五：讼，元吉。',  // 五爻
    '上九：或锡之鞶带，终朝三褫之。',  // 上爻
  ],
);
