import '../xiang.dictionary.dart';

// 天火同人
final tianHuoTongRen = XiangDicItem(
  name: '同人',
  description: '同人：同人于野，亨。利涉大川，利君子贞。',
  judgment: '''
同人，柔得位得中，而应乎乾，曰同人。
同人曰，同人于野，亨。
利涉大川，乾行也。
君子贞，正也。
至于天地，万物同归而殊涂，一致而百虑。
  ''',
  image: '''
天与火，同人。君子以类族辨物。
同人于野，志行也。
  ''',
  element: '火',
  nature: '和同共济',
  attribute: '同',
  luck: '吉',
  yaoTexts: [
    '初九：同人于门，无咎。',  // 初爻
    '六二：同人于宗，吝。',  // 二爻
    '九三：伏戎于莽，升其高陵，三岁不兴。',  // 三爻
    '九四：乘其墉，弗克攻，吉。',  // 四爻
    '九五：同人，先号啕而后笑。大师克相遇。',  // 五爻
    '上九：同人于郊，无悔。',  // 上爻
  ],
); 