import '../xiang.dictionary.dart';

// 天雷无妄
final tianLeiWuWang = XiangDicItem(
  name: '无妄',
  description: '无妄：元，亨，利，贞。其匪正有眚，不利有攸往。',
  judgment: '''
无妄，刚自外来，而为主于内。
动而健，刚中而应，大亨以正，天之命也。
其匪正有眚，不利有攸往。
无妄之往，何之矣？天命不祐，行矣哉？
  ''',
  image: '''
天下雷行，物与无妄。先王以茂对时，育万物。
无妄，刚自外来也。
  ''',
  element: '金',
  nature: '自然无妄',
  attribute: '正',
  luck: '吉',
  yaoTexts: [
    '初九：无妄，往吉。',  // 初爻
    '六二：不耕获，不菑畲，则利有攸往。',  // 二爻
    '六三：无妄之灾，或系之牛，行人之得，邑人之灾。',  // 三爻
    '九四：可贞，无咎。',  // 四爻
    '九五：无妄之疾，勿药有喜。',  // 五爻
    '上九：无妄，行有眚，无攸利。',  // 上爻
  ],
); 