import '../xiang.dictionary.dart';

// 天风姤
final tianFengGou = XiangDicItem(
  name: '姤',
  description: '姤：女壮，勿用取女。',
  judgment: '''
姤，遇也，柔遇刚也。
勿用取女，不可与长也。
天地相遇，品物咸章也。
刚遇中正，天下大行也。
姤之时义大矣哉！
  ''',
  image: '''
天下有风，姤。后以施命诰四方。
天下有风，姤。后以施命诰四方。
  ''',
  element: '金',
  nature: '邂逅相遇',
  attribute: '遇',
  luck: '凶',
  yaoTexts: [
    '初六：系于金柅，贞吉，有攸往，见凶，羸豕孚蹢躅。',  // 初爻
    '九二：包有鱼，无咎，不利宾。',  // 二爻
    '九三：臀无肤，其行次且，厉，无大咎。',  // 三爻
    '九四：包无鱼，起凶。',  // 四爻
    '九五：以杞包瓜，含章，有陨自天。',  // 五爻
    '上九：姤其角，吝，无咎。',  // 上爻
  ],
);
