import '../xiang.dictionary.dart';

// 乾为天
final qianWeiTian = XiangDicItem(
  name: '乾',
  description: '乾：元，亨，利，贞。',
  judgment: '''
大哉乾元，万物资始，乃统天。
云行雨施，品物流形。
大明终始，六位时成，时乘六龙以御天。
乾道变化，各正性命，保合大和，乃利贞。
首出庶物，万国咸宁。
  ''',
  image: '''
天行健，君子以自强不息。
见龙在田，德施普也。
  ''',
  element: '金',
  nature: '刚健中正',
  attribute: '大吉',
  luck: '大吉大利',
  yaoTexts: [
    '初九：潜龙，勿用。',  // 初爻
    '九二：见龙在田，利见大人。',  // 二爻
    '九三：君子终日乾乾，夕惕若，厉，无咎。',  // 三爻
    '九四：或跃在渊，无咎。',  // 四爻
    '九五：飞龙在天，利见大人。',  // 五爻
    '上九：亢龙，有悔。',  // 上爻
  ],
); 