import '../xiang.dictionary.dart';

// 天地否
final tianDiPi = XiangDicItem(
  name: '否',
  description: '否：否之匪人，不利君子贞，大往小来。',
  judgment: '''
否之匪人，不利君子贞。
大往小来，则是天地不交也，上下不通也。
内阴而外阳，内柔而外刚，
内小人而外君子，小人道长，君子道消也。
  ''',
  image: '''
天地不交，否。君子以俭德辟难，不可荣以禄。
是以君子，反身修德。
  ''',
  element: '土',
  nature: '闭塞不通',
  attribute: '否',
  luck: '凶',
  yaoTexts: [
    '初六：拔茅茹，以其汇。贞吉，亨。',  // 初爻
    '六二：包承，小人吉，大人否，亨。',  // 二爻
    '六三：包羞。',  // 三爻
    '九四：有命，无咎，畴离祉。',  // 四爻
    '九五：休否，大人吉。其亡其亡，系于苞桑。',  // 五爻
    '上九：倾否，先否后喜。',  // 上爻
  ],
);
