import '../xiang.dictionary.dart';

// 巽为风
final xunXun = XiangDicItem(
  name: '巽',
  description: '巽：小亨，利有攸往，利见大人。',
  judgment: '''
重巽以申命。
刚巽乎中正而志行。
柔皆顺乎刚，是以小亨，利有攸往，利见大人。
  ''',
  image: '''
随风，巽。君子以申命行事。
随风，巽。君子以申命行事。
  ''',
  element: '木',
  nature: '谦逊顺从',
  attribute: '巽',
  luck: '平',
  yaoTexts: [
    '初六：进退，利武人之贞。',  // 初爻
    '九二：巽在床下，用史巫纷若，吉无咎。',  // 二爻
    '九三：频巽，吝。',  // 三爻
    '六四：悔亡，田获三品。',  // 四爻
    '九五：贞吉，悔亡，无不利。无初有终，先庚三日，后庚三日，吉。',  // 五爻
    '上九：巽在床下，丧其资斧，贞凶。',  // 上爻
  ],
); 