import '../xiang.dictionary.dart';

// 泽地萃
final zeZiCui = XiangDicItem(
  name: '萃',
  description: '萃：亨。王假有庙，利见大人，亨，利贞。用大牲吉，利有攸往。',
  judgment: '''
萃，聚也。
顺以说，刚中而应，故聚也。
王假有庙，致孝享也。
利见大人亨，聚以正也。
用大牲吉，利有攸往，顺天命也。
观其所聚，而天地万物之情可见矣。
  ''',
  image: '''
泽上于地，萃。君子以除戎器，戒不虞。
泽上于地，萃。君子以除戎器，戒不虞。
  ''',
  element: '土',
  nature: '聚集会合',
  attribute: '聚',
  luck: '吉',
  yaoTexts: [
    '初六：有孚不终，乃乱乃萃，若号，一握为笑。勿恤，往无咎。',  // 初爻
    '六二：引吉，无咎，孚乃利用禴。',  // 二爻
    '六三：萃如，嗟如，无攸利，往无咎，小吝。',  // 三爻
    '九四：大吉，无咎。',  // 四爻
    '九五：萃有位，无咎。匪孚，元永贞，悔亡。',  // 五爻
    '上六：赍咨涕洟，无咎。',  // 上爻
  ],
);
