import '../xiang.dictionary.dart';

// 泽风大过
final zeFengDaGuo = XiangDicItem(
  name: '大过',
  description: '大过：栋桡，利有攸往，亨。',
  judgment: '''
大过，大者过也。
栋桡，本末弱也。
刚过而中，巽而说行。
利有攸往，乃亨。
大过之时大矣哉！
  ''',
  image: '''
泽灭木，大过。君子以独立不惧，遁世无闷。
栋桡之难，独立之义也。
  ''',
  element: '木',
  nature: '过度不及',
  attribute: '过',
  luck: '凶',
  yaoTexts: [
    '初六：藉用白茅，无咎。',  // 初爻
    '九二：枯杨生稊，老夫得其女妻，无不利。',  // 二爻
    '九三：栋桡，凶。',  // 三爻
    '九四：栋隆，吉。有它，吝。',  // 四爻
    '九五：枯杨生华，老妇得其士夫，无咎无誉。',  // 五爻
    '上六：过涉灭顶，凶，无咎。',  // 上爻
  ],
); 