import '../xiang.dictionary.dart';

// 泽风节
final zeFengJie = XiangDicItem(
  name: '节',
  description: '节：亨。苦节不可贞。',
  judgment: '''
节，亨，刚柔分，而刚得中。
苦节不可贞，其道穷也。
说以行险，当位以节，中正以通。
天地节而四时成，节以制度，不伤财，不害民。
  ''',
  image: '''
泽上有风，节。君子以制数度，议德行。
泽上有风，节。君子以制数度，议德行。
  ''',
  element: '金',
  nature: '节制制度',
  attribute: '节',
  luck: '平',
  yaoTexts: [
    '初九：不出户庭，无咎。',  // 初爻
    '九二：不出门庭，凶。',  // 二爻
    '六三：不节若，则嗟若，无咎。',  // 三爻
    '六四：安节，亨。',  // 四爻
    '九五：甘节，吉，往有尚。',  // 五爻
    '上六：苦节，贞凶，悔亡。',  // 上爻
  ],
); 