import '../xiang.dictionary.dart';

// 泽火革
final zeHuoGe = XiangDicItem(
  name: '革',
  description: '革：己日乃孚。元亨利贞。悔亡。',
  judgment: '''
革，水火相息，二女同居，其志不同行。
说以泽，巽而顺，刚中而应，是以大亨。
己日乃孚，革而信也。
文明以说，大亨以正，革而当，其悔乃亡。
天地革而四时成，汤武革命，顺乎天而应乎人。
革之时大矣哉。
  ''',
  image: '''
泽中有火，革。君子以治历明时。
泽中有火，革。君子以治历明时。
  ''',
  element: '火',
  nature: '改革变革',
  attribute: '革',
  luck: '平',
  yaoTexts: [
    '初九：巩用黄牛之革。',  // 初爻
    '六二：己日乃革之，征吉，无咎。',  // 二爻
    '九三：征凶，贞厉。革言三就，有孚。',  // 三爻
    '九四：悔亡，有孚改命，吉。',  // 四爻
    '九五：大人虎变，未占有孚。',  // 五爻
    '上六：君子豹变，小人革面，征凶，居贞吉。',  // 上爻
  ],
);
