import '../xiang.dictionary.dart';

// 泽火睽
final zeHuoKui = XiangDicItem(
  name: '睽',
  description: '睽：小事吉。',
  judgment: '''
睽，火动而上，泽动而下。
二女同居，其志不同行。
说而丽乎明，柔进而上行。
得敌而解，而上行。
是以小事吉。
  ''',
  image: '''
上火下泽，睽。君子以同而异。
睽，火动而上，泽动而下。
  ''',
  element: '火',
  nature: '乖违背离',
  attribute: '违',
  luck: '凶',
  yaoTexts: [
    '初九：悔亡，丧马勿逐，自复；见恶人，无咎。',  // 初爻
    '九二：遇主于巷，无咎。',  // 二爻
    '六三：见舆曳，其牛掣，其人天且劓，无初有终。',  // 三爻
    '九四：睽孤，遇元夫，交孚，厉无咎。',  // 四爻
    '六五：悔亡，厥宗噬肤，往何咎。',  // 五爻
    '上九：睽孤，见豕负涂，载鬼一车，先张之弧，后说之弧，匪寇婚媾，往遇雨则吉。',  // 上爻
  ],
); 