import '../xiang.dictionary.dart';

// 泽山咸
final zeShanXian = XiangDicItem(
  name: '咸',
  description: '咸：亨，利贞，取女吉。',
  judgment: '''
咸，感也。
柔上而刚下，二气感应以相与，止而说，男下女，是以亨利贞，取女吉也。
天地感而万物化生，圣人感人心而天下和平。
观其所感，而天地万物之情可见矣。
  ''',
  image: '''
山上有泽，咸。君子以虚受人。
山上有泽，咸。君子以虚受人。
  ''',
  element: '水',
  nature: '感应相合',
  attribute: '感',
  luck: '吉',
  yaoTexts: [
    '初六：咸其拇。',  // 初爻
    '六二：咸其腓，凶，居吉。',  // 二爻
    '九三：咸其股，执其随，往吝。',  // 三爻
    '九四：贞吉，悔亡，憧憧往来，朋从尔思。',  // 四爻
    '九五：咸其脢，无悔。',  // 五爻
    '上六：咸其辅，颊，舌。',  // 上爻
  ],
);
