import '../xiang.dictionary.dart';

// 泽水困
final zeShuiKun = XiangDicItem(
  name: '困',
  description: '困：亨，贞，大人吉，无咎，有言不信。',
  judgment: '''
困，刚掩也。
险以说，困而不失其所，亨，其唯君子乎。
贞大人吉，以刚中也。
有言不信，尚口乃穷也。
  ''',
  image: '''
泽无水，困。君子以致命遂志。
泽无水，困。君子以致命遂志。
  ''',
  element: '水',
  nature: '困境困厄',
  attribute: '困',
  luck: '凶',
  yaoTexts: [
    '初六：臀困于株木，入于幽谷，三岁不见。',  // 初爻
    '九二：困于酒食，朱绂方来，利用亨祀，征凶，无咎。',  // 二爻
    '六三：困于石，据于蒺藜，入于其宫，不见其妻，凶。',  // 三爻
    '九四：来徐徐，困于金车，吝，有终。',  // 四爻
    '九五：劓刖，困于赤绂，乃徐有说，利用祭祀。',  // 五爻
    '上六：困于葛藟，于臲卼，曰动悔。有悔，征吉。',  // 上爻
  ],
);
