import '../xiang.dictionary.dart';

// 泽天夬
final zeTianGuai = XiangDicItem(
  name: '夬',
  description: '夬：扬于王庭，孚号，有厉，告自邑，不利即戎，利有攸往。',
  judgment: '''
夬，决也，刚决柔也。
健而说，决而和。
扬于王庭，柔乘五刚也。
孚号有厉，其危乃光也。
告自邑，不利即戎，所尚乃穷也。
利有攸往，刚长乃终也。
  ''',
  image: '''
泽上于天，夬。君子以施禄及下，居德则忌。
泽上于天，夬。君子以施禄及下，居德则忌。
  ''',
  element: '金',
  nature: '决断果断',
  attribute: '决',
  luck: '平',
  yaoTexts: [
    '初九：壮于前趾，往不胜为咎。',  // 初爻
    '九二：惕号，莫夜有戎，勿恤。',  // 二爻
    '九三：壮于頄，有凶。君子夬夬，独行遇雨，若濡有愠，无咎。',  // 三爻
    '九四：臀无肤，其行次且。牵羊悔亡，闻言不信。',  // 四爻
    '九五：苋陆夬夬，中行无咎。',  // 五爻
    '上六：无号，终有凶。',  // 上爻
  ],
);
