import '../xiang.dictionary.dart';

// 雷泽丰
final zhenZeFeng = XiangDicItem(
  name: '丰',
  description: '丰：亨。王假之，勿忧，宜日中。',
  judgment: '''
丰，大也。
明以动，故丰。
王假之，尚大也。
勿忧宜日中，宜照天下也。
日中则昃，月盈则食，天地盈虚，与时消息，而况于人乎？
况于鬼神乎？
  ''',
  image: '''
雷电皆至，丰。君子以折狱致刑。
雷电皆至，丰。君子以折狱致刑。
  ''',
  element: '火',
  nature: '盛极将衰',
  attribute: '丰',
  luck: '平',
  yaoTexts: [
    '初九：遇其配主，虽旬无咎，往有尚。',  // 初爻
    '六二：丰其蔀，日中见斗，往得疑疾，有孚发若，吉。',  // 二爻
    '九三：丰其沛，日中见沫，折其右肱，无咎。',  // 三爻
    '九四：丰其蔀，日中见斗，遇其夷主，吉。',  // 四爻
    '六五：来章，有庆誉，吉。',  // 五爻
    '上六：丰其屋，蔀其家，窥其户，阒其无人，三岁不见，凶。',  // 上爻
  ],
); 