import '../xiang.dictionary.dart';

// 震为雷
final zhenZhen = XiangDicItem(
  name: '震',
  description: '震：亨。震来虩虩，笑言哑哑。震惊百里，不丧匕鬯。',
  judgment: '''
震，亨。震来虩虩，恐致福也。
笑言哑哑，后有则也。
震惊百里，惊远而惧迩也。
不丧匕鬯，出可以守宗庙社稷，以为祭主也。
  ''',
  image: '''
洊雷，震。君子以恐惧修省。
洊雷，震。君子以恐惧修省。
  ''',
  element: '木',
  nature: '震动警惕',
  attribute: '震',
  luck: '凶',
  yaoTexts: [
    '初九：震来虩虩，后笑言哑哑，吉。',  // 初爻
    '六二：震来厉，亿丧贝，跻于九陵，勿逐，七日得。',  // 二爻
    '六三：震苏苏，震行无眚。',  // 三爻
    '九四：震遂泥。',  // 四爻
    '六五：震往来厉，亿无丧，有事。',  // 五爻
    '上六：震索索，视矍矍，征凶。震不于其躬，于其邻，无咎。婚媾有言。',  // 上爻
  ],
);